module.exports = {
  content: [
    "./src/**/*.{js,jsx,ts,tsx}",
  ],
  theme: {
    extend: {
      colors: {
        // Цвета подобраны пипеткой с макета
        sage: {
          100: '#E6F2EB', // Очень светлый фон
          200: '#CDE4D6', // Светлый для карточек
          300: '#B2D8C3', // Основной фон элементов
          400: '#94C2A8', // Кнопки
          500: '#7AA68D', // Кнопки (ховер)
          600: '#5E806A', // Текст заголовков
        },
        gray: {
          custom: '#808080' // Для текста кнопок "Назад" и т.д.
        }
      }
    },
  },
  plugins: [],
}